002_cylinder2D_base/simpleFoam/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType laminar;
// simulationType      RAS;

// RAS
// {
//     // Tested with kEpsilon, realizableKE, kOmega, kOmegaSST,
//     // ShihQuadraticKE, LienCubicKE.
//     RASModel        kEpsilon;

//     turbulence      on;

//     printCoeffs     on;
// }


// ************************************************************************* //
