002_cylinder2D_base/simpleFoam/Allrun
#!/bin/bash

decomposePar
mpirun -np 4 simpleFoam -parallel > log.simpleFoam 
reconstructPar
rm -r processor*