002_cylinder2D_base/simpleFoam/Allrun.pre
#!/bin/bash

blockMesh
mirrorMesh -dict system/mirrorMeshDict.X -overwrite
mirrorMesh -dict system/mirrorMeshDict.Y -overwrite
autoPatch 45 -overwrite
createPatch -overwrite
extrudeMesh
